<template>
  <div class="arx-content">
    <h1>Создание ювелирного каталога EFREMOV</h1>
    <p>
      Клиент пришёл к нам со старым каталогом, написанным лет 10 назад, уже его
      клиенты жалуются, что не удобно. Потребность было сделать новый
      современным, и по технологиям, и по дизайну. “Как у лидеров рынка!”. Также
      важна быстрая скорость работы и добавить ещё дюжину фич!
    </p>
    <h2>Проблемы старого каталога</h2>
    <ul>
      <li>слабая презентация товаров</li>
      <li>мало возможностей выборки товаров в каталоге</li>
      <li>сложности с новым функционалом из-за старого кода и потерявшегося
        разработчика
      </li>
      <li>нет системы сбора и аналитики данных для тестирования идей</li>
    </ul>
    <h2>Аналитика проекта</h2>
    <p>
      Аналитиком проведено несколько встреч в ходе которых собраны требования,
      формализованы по методологии User Story Map.
    </p>
    <p>
      Каждая ключевая бизнес потребность записывалась как отдельная история,
      истории сложились в матрицу и составили дорожную карту проекта.
    </p>
    <figure>
      <img src="~/assets/images/articles/efremov/user-story.png">
    </figure>

  </div>
</template>

<script>
export default {
  layout: 'article',
}
</script>

<style lang="scss"></style>
